sarjun/MSP430LocalNetwork/Source/CapstoneLocalComm/manchesterio-main.c
void debugging(void) ; //Just some dummy code to exercise the xmitter.
void main(void) {
//Be sure to stop watchdog timer first!

	WDTCTL = WDTHOLD + WDTPW ;

	InitHardware() ;
	InitVariables() ;

//Enable Global Interrupts after all intializing is done.
#ifndef DEBUGGING
	_EINT() ;
#endif

	while (1) { //Main code loop here :

#ifdef DEBUG_RCVR
		if (InsertFlag != 0){
			_nop() ;
			InsertEvent(DebugEdge,DummyTimer) ;
			_nop() ;
			InsertEvent(DebugEdge,DummyTimer) ;
			_nop() ;
		}
#endif

		rcv() ; //Call the receiver
		_nop();
		if(!Rcv1.BitsLeftToGet && Rcv1.LastValidReceived) {
			_nop();
		}
#ifdef DEBUG_XMITTER
		debugging() ;
#endif
		_nop() ;
	}
}

//This function re-initializes the transmitter section
void ReinitXmitter(void) ;
//Set up globals, including the transmitter structure.
//Comment Well
void InitVariables(void){
//Here is an example:
//	Xmit1.Bits_Remaining = BITS_IN_TRANSMISSION ;
	Xmit1.Transmit_Data_Buffer = 0xAA55AA55 ;  //
//	Xmit1.Transmit_Data = 0xAA55AA55        ; //This is just sample data, the final application Determines what is to be sent.
//	Xmit1.Transmit_Clock_Phase = Low ;
//"Real Initialization starts here
	ReinitXmitter() ;
//etc. .....
	Receiver_Events.Get_Index = 0 ;
	Receiver_Events.Put_index = 0 ;
	Receiver_Events.QueSize   = 0 ;

//etc.........
	Rcv1.CurrentRcvState = Initial_Expect_Rising ;
	Rcv1.CurrentRecvdData =      0 ;
	Rcv1.FallingEdgeTimeStamp =  0 ;
	Rcv1.RisingEdgeTimeStamp =   0 ;
	Rcv1.MidBitTimeStamp =       0 ;
	Rcv1.PulseWidth =            0 ;
	Rcv1.CurrentRecvdData =      0 ;
	Rcv1.LastValidReceived =     0 ;

}

//This routine manages the actual transmitter and is called every 500uS by a periodic interrupt.
//Comment Well
void Xmit(TransmitterData* TData) {
	enum XmitClockPhase Phase;
	unsigned long  Test_MSBit ; //This is used as a boolean to test the XOR of the MS Bit of the Xmitted Word.
	Phase = TData->Transmit_Clock_Phase ;
	Test_MSBit = TData->Transmit_Data & 0x80000000 ; // We will use this as an "XOR" test in the transmitter phases.
//Now do state machine
	switch(TData->Transmitter_State){
		case StartBit : //This sends the equivalent of a 1-0 preamble to start the receiver in the right state.
			TX_RCV_MODE = HIGH ;
			DEBUG_LED = LED_ON ;
			switch(Phase) {
				case Low :
					if (Test_MSBit != 0) {
						TRANSMIT_PIN = HIGH ;
					}
					else {
						TRANSMIT_PIN = LOW ;
					}
					TData->Transmit_Data <<= 1 ;
					if (--TData->Bits_Remaining == 0) { //Here we have used up all bits on to next phase
						TData->Bits_Remaining = BITS_IN_TRANSMISSION ;
						TData->Transmit_Data  = TData->Transmit_Data_Buffer ;  //Transfer the buffer to the real word to be shifted out
						TData->Transmitter_State = NormalXmit ;
					}
				break ;
				case High :
					if (Test_MSBit != 0) {
						TRANSMIT_PIN = LOW ;
					}
					else {
						TRANSMIT_PIN = HIGH ;
					}
				break ;
			}
		break ;

		case NormalXmit :
			switch(Phase) {
				case Low :
					if (Test_MSBit != 0) {
						TRANSMIT_PIN = HIGH ;
					}
					else {
						TRANSMIT_PIN = LOW ;
					}
					TData->Transmit_Data <<= 1 ;        //get the next bit up to go
					if (--TData->Bits_Remaining == 0) { //Here we have used up all bits on to next phase
						TData->InterwordTimeout = INTERWORD_DELAY ; //This delays 50 mS between Xmissions
						TData->Transmitter_State = InterWord ;
					}
				break ;
				case High :
					if (Test_MSBit != 0) {  //Effectively an XOR operation
						TRANSMIT_PIN = LOW ;
					}
					else {
						TRANSMIT_PIN = HIGH ;
					}
				break ;
			}

		break ;
		case InterWord :
			TX_RCV_MODE = LOW ;
			DEBUG_LED = LED_OFF ;
			switch(Phase) {
				case Low :
					TRANSMIT_PIN = LOW ;
					if (--TData->InterwordTimeout == 0){
						ReinitXmitter() ;
					}

				break ;
				case High :
					TRANSMIT_PIN = LOW ;
				break ;
			}

		break ;
		default :
			ReinitXmitter() ;
//Other intitialization here.....
		break ;

	}
}

//This should be called Frequently from the main loop.
void rcv(void){
	int index ;
	PulseWidthStatus PWidth ;
	unsigned int CurrentTime ;
	Event_Que_Entry Current_Event ;
#ifdef DEBUG_RCVR
	CurrentTime =  DummyTAR ;
#endif
#ifndef DEBUG_RCVR
	CurrentTime = TA1R ; //Get the approximate current timestamp.
#endif
	if ((CurrentTime - Rcv1.LastEdgeTimeStamp) > MISSING_EDGE_TIMEOUT ){//Here we have had no transmissions in a while
		Rcv1.CurrentRcvState = Initial_Expect_Rising ;
	}
	index = GetEvent() ;
	_nop();
	if (index != -1 ) { //Here we have an edge to deal with, -1 indicates no event in queue
		Current_Event.Edge = Receiver_Events.Events[(unsigned int)index].Edge ;
		Current_Event.TimeStamp = Receiver_Events.Events[(unsigned int)index].TimeStamp ;
		//Now insert receiver state machine here
		Rcv1.LastEdgeTimeStamp = Current_Event.TimeStamp ; //This marks the last time that we got any time stamp at all
		switch (Rcv1.CurrentRcvState){
			// Ignore transitions until we get a rising one.
			case Initial_Expect_Rising :
				if (Current_Event.Edge == Rising) { //Leading edge of initial lead-in bit
					Rcv1.CurrentRcvState = Initial_Expect_Falling ;
					Rcv1.RisingEdgeTimeStamp = Current_Event.TimeStamp ;
				}
			break ;
			case Initial_Expect_Falling :
				if (Current_Event.Edge == Rising){
					Rcv1.CurrentRcvState = Initial_Expect_Rising ; //Out of sequence start over
				}
				else {
					Rcv1.FallingEdgeTimeStamp = Current_Event.TimeStamp ;  //Figure out when it happens
					Rcv1.PulseWidth = Rcv1.FallingEdgeTimeStamp - Rcv1.RisingEdgeTimeStamp ; // And Test validity
					PWidth = TestWidth(Rcv1.PulseWidth) ;
					if (PWidth == Valid_FullBit) { //Here we have a valid full initial bit
						Rcv1.CurrentRecvdData = 0 ; // Start all over for receiver
						Rcv1.MidBitTimeStamp = Rcv1.FallingEdgeTimeStamp ; // By definition at mid bit....
						Rcv1.BitsLeftToGet = BITS_IN_TRANSMISSION ;
						Rcv1.CurrentRcvState = MidBit_Expect_Rising ; //Next bit is start of "real" data
					}
					else Rcv1.CurrentRcvState = Initial_Expect_Rising ; //Likely a noise pulse, start over
				}
			break ;
			case MidBit_Expect_Falling :
				if (Current_Event.Edge == Rising) { //Out of sequence - start over
					Rcv1.CurrentRcvState = Initial_Expect_Rising ;
				}
				else {
					Rcv1.FallingEdgeTimeStamp = Current_Event.TimeStamp ;
					Rcv1.PulseWidth = Rcv1.FallingEdgeTimeStamp - Rcv1.MidBitTimeStamp ; // Get width relative to last mid-bit
					PWidth = TestWidth(Rcv1.PulseWidth) ;
					if (PWidth == Valid_HalfBit) { //Here we have a half-bit, phasing transition
						Rcv1.CurrentRcvState = MidBit_Expect_Rising ; // Got to expect a rising edge at mid-bit
					}
					else {
						if (PWidth == Valid_FullBit) {    // Rising Edge at mid-bit , clock in a 1
							Rcv1.CurrentRecvdData <<= 1 ; // Room for new bit
							--Rcv1.BitsLeftToGet ;
							if (Rcv1.BitsLeftToGet == 0){ //All done Start over
								Rcv1.LastValidReceived = Rcv1.CurrentRecvdData ; //Buffer up last received value
								Rcv1.CurrentRcvState = Initial_Expect_Rising ;
							}
							else {
								Rcv1.MidBitTimeStamp = Rcv1.FallingEdgeTimeStamp ; //New mark for mid-bit
								Rcv1.CurrentRcvState = MidBit_Expect_Rising    ; //And Expect a rising edge
							}
						}
						else{
							Rcv1.CurrentRcvState = Initial_Expect_Rising ; // Bad pulse width
						}
					}
				}
			break ;
			//We arrived here from a valid mid-bit transition previously
			case MidBit_Expect_Rising :
				if (Current_Event.Edge == Falling) { //Out of sequence - start over
					Rcv1.CurrentRcvState = Initial_Expect_Rising ;
				}
				else {
					Rcv1.RisingEdgeTimeStamp = Current_Event.TimeStamp ;
					Rcv1.PulseWidth = Rcv1.RisingEdgeTimeStamp - Rcv1.MidBitTimeStamp ; // Get width relative to last mid-bit
					PWidth = TestWidth(Rcv1.PulseWidth) ;
					if (PWidth == Valid_HalfBit) { //Here we have a half-bit, phasing transition
						Rcv1.CurrentRcvState = MidBit_Expect_Falling ; // Got to expect a falling edge at mid-bit
					}
					else {
						if (PWidth == Valid_FullBit) {    // Rising Edge at mid-bit , clock in a 1
							Rcv1.CurrentRecvdData <<= 1 ; // Room for new bit
							Rcv1.CurrentRecvdData |= 0x01 ;
							--Rcv1.BitsLeftToGet ;
							if (Rcv1.BitsLeftToGet == 0){ //All done Start over
								Rcv1.LastValidReceived = Rcv1.CurrentRecvdData ; //Buffer up last received value
								Rcv1.CurrentRcvState = Initial_Expect_Rising ;
							}
							else {
								Rcv1.MidBitTimeStamp = Rcv1.RisingEdgeTimeStamp ; //New mark for mid-bit
								Rcv1.CurrentRcvState = MidBit_Expect_Falling    ; //And Expect a falling edge
							}
						}
						else{
							Rcv1.CurrentRcvState = Initial_Expect_Rising ; // Bad pulse width
						}
					}
				}
			break ;
			default:
				Rcv1.CurrentRcvState = Initial_Expect_Rising ;
			break ;
		}
	}

