sarjun/MSP430LocalNetwork/Source/CapstoneLocalComm/manchesterio-main.c
}

//This function places a new event in the event queue structure.
//The rising and falling edge detectors should call this handler with the appropriate info!
QueReturnErrors InsertEvent(EdgeType DetectedEdge, unsigned int CapturedTime){
	QueReturnErrors rval ;
	unsigned int putindex ;
	rval = No_Error ;
	if (Receiver_Events.QueSize == 4) {//Here Que is already full
		rval = Que_Full ;
	}
	else { //Here we can insert a new event
		++Receiver_Events.QueSize ;
		putindex = Receiver_Events.Put_index ;
		Receiver_Events.Events[putindex].Edge = DetectedEdge ;
		Receiver_Events.Events[putindex].TimeStamp = CapturedTime ;
		++putindex ;
		putindex &= SIZE_OF_RCV_QUE-1 ; //Note the constant must always be a power of 2!
		Receiver_Events.Put_index = putindex ;
	}
	return rval ;
}

//This is called from within the main loop to see if there are any events on the que, i.e. captured edges.
//Note that it disables interrupts to ensure that data is not overwritten by an interrupter
//if the return value is negative, then the queue is empty, else it returns an index to the oldest event in the
//queue
int GetEvent(void){

	int rval ;
	unsigned int getindex ;
	rval = -1 ;
	asm("  PUSH.B SR") ;

	_DINT() ;
	if (Receiver_Events.QueSize == 0) { //Nothing to be had!
		rval = -1 ;
	}
	else {
		getindex = Receiver_Events.Get_Index ;
		rval = (int)(getindex) ;
		++getindex ;
		getindex &= SIZE_OF_RCV_QUE-1 ; //Note the constant must always be a power of 2!
		Receiver_Events.Get_Index = getindex ;
		--Receiver_Events.QueSize ;
	}
	asm("  POP.B SR");
	return rval ;
}

//This functions tests a current pulse width and determines if it is a valid width
PulseWidthStatus TestWidth(unsigned int CurrentPulse){
	PulseWidthStatus rval ;
	rval = Invalid_Width ;
	if ((CurrentPulse >= VALID_HALF_BIT_MIN) && (CurrentPulse <= VALID_HALF_BIT_MAX)) {
		rval = Valid_HalfBit ;
	}
	else {
		if ((CurrentPulse >= VALID_FULL_BIT_MIN) && (CurrentPulse <= VALID_FULL_BIT_MAX)){
			rval = Valid_FullBit ;
		}
	}
	return rval ;
}


//Functions called via an  interrupt
//This is called every 500uS by the timer A0 interrupt function
void ihandler(void) {
//Do whatever needs to be done on a periodic basis here:
	Xmit(&(Xmit1)) ;
}

//This called by the capture routine on the rising edge of the input signal
void risingedge(void) {
	InsertEvent(Rising, TA1CCR2) ;	//Insert this event into event Queue
}

void fallingedge(void){
	InsertEvent(Falling, TA1CCR1) ; //Insert this event into event Queue.
}


//Defines for initializiation of various subsystems
//Clock System Initialization
void BCSplus_initial(void) ;
//Timer Initial..
void Timer0_A3_initial(void) ;
void Timer1_A3_initial(void) ;
//All hardware initializing is done here.

//Comment Well!
void InitHardware(void) {

//Set up ports here :
	P1OUT = 0 ;
	P2OUT = 0 ;   //Establish Safe Values for start up.
	TX_RCV_MODE = LOW ;  //Asuume starting out to receive.
	TX_RCV_PORT_DIR |= 1<<TX_RCV_BIT ;
	TRANSMIT_PIN = LOW ;
	TRANSMIT_PORT_DIR |= 1<<TRANSMIT_BIT ;  //Enable output pin for xmitter
	LED_PORT_DIR |= 1<<LED_BIT ;
	DEBUG_LED = LED_ON ;
	_nop() ;
	DEBUG_LED = LED_OFF ;
//Set up Pins for Receiver : Choose Select Pins to access pins to timer system ...
	RCV_PORT_SEL = 0 ;
	RCV_PORT_SEL |= (1<< RCV_CAPTURE_BIT0)+(1<<RCV_CAPTURE_BIT1);
	RCV_PORT_SEL2 = 0 ;
//
// End of port setup/
	BCSplus_initial()   ; //get clock going - 8 mhz rate

    P2IE |= BIT0;
    P2REN |= BIT0;
    P2OUT |= BIT0;
	P2IFG &= ~BIT0;


#ifndef DEBUG_RCVR
	Timer0_A3_initial() ;
	Timer1_A3_initial() ;


#endif
}

//This function re-initializes the transmitter section
void ReinitXmitter(void) {
	Xmit1.Bits_Remaining = 2 ;  //We enter the start bit state to send a 1-0 sequence which guarantees a valid full bit to start
	Xmit1.Transmitter_State = StartBit ;
	Xmit1.Transmit_Data = 0x80000000   ;   //This will be a binary 1-0 for the startup (We send MS Bits first)
	Xmit1.Transmit_Clock_Phase = Low ;
}


// Interrupt Handlers Start Here

int send = 0;
#pragma vector=TIMER0_A0_VECTOR
__interrupt void periodicTimerA0Interrupt(void){
	/* Capture Compare Register 0 ISR Hook Function Name */
	//Each 500 uS half bit period constitutes a separate clock "phase" for transmitter purposes.
	if (Xmit1.Transmit_Clock_Phase == Low){
		Xmit1.Transmit_Clock_Phase = High ;
	}
	else Xmit1.Transmit_Clock_Phase = Low ;
	if(send) ihandler();
	_nop();
	/* No change in operating mode on exit */
}

#pragma vector = PORT2_VECTOR
__interrupt void Button_routine (void) {
	// Handle the button
	if(send) ReinitXmitter(); // Do we need this
	send = 1 - send;
	P2IFG &= ~BIT0;
}


/*
 *  ======== Timer1_A3 Interrupt Service Routine ========
 */
#pragma vector=TIMER1_A0_VECTOR
__interrupt void timerCaptureRisingInterrupt(void){
	/* Capture Compare Register 0 ISR Hook Function Name */
	_nop() ;
}

/*
 *  ======== Timer1_A3 Interrupt Service Routine ========
 */
#pragma vector=TIMER1_A1_VECTOR
__interrupt void timerCaptureFallingInterrupt(void){
    switch (__even_in_range(TA1IV, TA1IV_TAIFG))    // Efficient switch-implementation
    {
        case TA1IV_TACCR1:
            /* Capture Compare Register 1 ISR Hook Function Name */
            fallingedge();
            /* No change in operating mode on exit */
            break;
        case TA1IV_TACCR2:
        	risingedge();
        	/* No change in operating mode on exit */
            break;
        case TA1IV_TAIFG:
            break;
    }
}

/*
 *  ======== BCSplus_init ========
 *  Initialize MSP430 Basic Clock System
 */
void BCSplus_initial(void)
{
    /*
     * Basic Clock System Control 2
     *
     * SELM_0 -- DCOCLK
     * DIVM_0 -- Divide by 1
     * ~SELS -- DCOCLK
     * DIVS_0 -- Divide by 1
     * ~DCOR -- DCO uses internal resistor
     *
     * Note: ~<BIT> indicates that <BIT> has value zero
     */
    BCSCTL2 = SELM_0 + DIVM_0 + DIVS_0;

    if (CALBC1_8MHZ != 0xFF) {
        /* Adjust this accordingly to your VCC rise time */
        __delay_cycles(100000);

        // Follow recommended flow. First, clear all DCOx and MODx bits. Then
        // apply new RSELx values. Finally, apply new DCOx and MODx bit values.
        DCOCTL = 0x00;
        BCSCTL1 = CALBC1_8MHZ;      /* Set DCO to 8MHz */
        DCOCTL = CALDCO_8MHZ;
    }

